import sys

# Все, до чого можна застосувати for … in … : є ітерованими (iterable)  об'єктами: lists, strings, files…

# елементи списку можна прочитати один за одним використовуючи ітерацію:
print(10*" =Ітератори= ")

# my_list = [1, 2, 3] # my_list є ітерованим об'єктом.
# for i in my_list:                                                       
#    print(i)

# списковий вираз також є ітерованим.
# my_list = [x*x for x in range(3)]
# for i in my_list:
#    print(i)

# Ітерації зручно використовувати, тому що, дані можна прочитати багато разів, але вони зберігаються в пам'яті й інколи це призводить до зайвих затрат ресурсів.

print(10*" =генератори= ")
# Генератори це ті ж самі ітератори, але дані можна ітерувати лише один раз.
# Це тому, що вони не зберігаються в пам'яті, а генеруються на льоту:

my_generator = (x*x for x in range(3))
for i in my_generator:
   print(i)
print(my_generator)
print(type(my_generator))
for i in my_generator:
   print(i)

# Генератори використовують такий же синтаксис, як і спискові вирази, окрім дужок: ( ) замість [ ].

# Ви не можете виконати for i in my_generator вдруге, оскільки генератор може бути використаний лише раз: він вираховує 0, тоді видаляє його з пам'яті і обчислює 1, видаляє його, обчислює 4 і також його видаляє, один за одним.

# Існує 2 способи створення генераторів: за допомогою генераторних функцій і генераторних виразів.

# Функції-генератори є особливим типом функцій, які повертають відкладений (лінивий) ітератор - об’єкт, схожий на список, проте ліниві ітератори не зберігають свій вміст у пам’яті.

# Генераторні вирази дозволяють швидко створити об’єкт генератора та корисні у випадках, коли використовується розуміння списків, з додатковою перевагою: можна створити їх без створення та зберігання всього об’єкта в пам’яті перед ітерацією. 

# Створення об’єкту-генератора 

nums_squared_gc = (num**2 for num in range(5))
print(nums_squared_gc)
# #<generator object <genexpr> at 0x107fbbc78>
print(list(nums_squared_gc))
# #[0, 1, 4, 9, 16]
my_generator = (x*x for x in range(1000))
my_lust = [x*x for x in range(1000)]
# print(sys.getsizeof(my_lust))
# print(sys.getsizeof(my_generator))

# Generator expression дозволяє створювати генератор на льоту за допомогою круглих дужок

# gen_exp = (x ** 2 for x in range(10) if x % 2 == 0)
# for x in gen_exp:  print(x)

# єдина різниця полягає в тому, що використовуються круглі дужки замість квадратних.
# multiples_gen = (i for i in range(30) if i % 3 == 0)

# типи даних, що повертають list comprehension та виразами генератора, відрізняються.
# print(multiples_gen) # Output: <generator object <genexpr> at 0x7fdaa8e407d8>
# list_comp = [x ** 2 for x in range(10) if x % 2 == 0]
# gen_exp = (x ** 2 for x in range(10) if x % 2 == 0)
# print(list_comp) # [0, 4, 16, 36, 64]
# print(gen_exp) # <generator object <genexpr> at 0x7f600131c410>
# my_generator = (x*x for x in range(1000))

# Генераторні вирази обчислюються ліниво, тобто генератору не потрібна пам’ять для всього списку, він генерує по одному елементу за раз. Метод sys.getsizeof() застосовують для виміру кількості пам'яті у байтах, необхідної для збереження об'єкта.
# a = [i for i in range(10)]
# print(sys.getsizeof(a)) # кількість пам'яті у байтах:
# під час створення списку Python резервує пам’ять для всього списку та обчислює його на місці.

# print("Python резервує пам’ять для всього списку та обчислює його на місці.")
# b = (i for i in range(10))
# print(sys.getsizeof(b))

# Генератор генеруватиме лише наступний елемент послідовності на вимогу.
# c = [i for i in range(10000)]
# print("енератор генеруватиме лише наступний елемент послідовності на вимогу")
# print(sys.getsizeof(c)) # 87624
# d = (i for i in range(10000))
# print(sys.getsizeof(d)) # 120

# Генератор працює повільніше, бо коли елемент послідовності обчислюється та повертається, контекст/стан функції має бути збережено. Наступного разу контекст/стан функції використовується для генерації наступного значення. Збереження і завантаження контексту/стану вимагає часу.
# print("Генератор працює повільніше, бо коли елемент послідовності обчислюється та повертається, контекст/стан функції має бути збережено.")
# my_generator = (x*x for x in range(1000))
# print(sys.getsizeof(my_generator))

# for i in my_generator:
#     print(i)
    
# for i in my_generator:
#     print(i)
    
# my_list = [x*x for x in range(1000)]
# print(sys.getsizeof(my_list))

# for i in my_list:
#     print(i)
    
# for i in my_list:
#     print(i)
    
# print(my_list)

# print(my_generator)


def firstn(n):
   num = 0
   while num < n:
      yield num
      num += 1

sum_of_first_n = sum(firstn(100000000000))
print(sum_of_first_n)
