import csv

with open('users.csv', mode='r', newline='') as csv_file:
    csv_reader = csv.reader(csv_file)
    # throw titles, if it's not needed
    next(csv_reader) 
    for row in csv_reader:
        # row — list, ex: ['John Smith', 'Accounting', 'November']
        print(f'{row[0]} working in dep  {row[1]}  born in month {row[2]}.')

# Ключові моменти: 

# with open(...): Це бажаний спосіб роботи з файлами. Він гарантує, що файл буде автоматично закрито, навіть якщо в процесі виникне помилка. 

# newline='': Цей параметр — критично важливий. Модуль csv самостійно керує закінченнями рядка. Якщо не вказати новий рядок='', в деяких даних системах (наприклад, Windows) при записі можуть з'явитися пусті рядки між ними, а при чтенні можуть виникнути помилки. 

# csv.reader(csv_file): Створює ітератор, який ми можемо використовувати в циклі для отримання рядка одного за іншим. 

# Обробка даних: csv.reader повертає кажний рядок як список рядків. Це означає, що навіть якщо у файлі були числа, вони будуть прочитані як '123', а не 123. Вам потрібно буде самостійно перетворювати типи даних за необхідності.
