
# Функція map(<function>, iterable[, iterable1, ..., iterableN]) по черзі застосовує аргумент-функцію <function> до кожного елемента в iterable. Функція map() повертає об’єкт-ітератор. 
# Аргументи:
# <function> містить функцію перетворення. Ця функція має приймати стільки аргументів, скільки ітерацій ви передаєте в map().
# iterable містить об’єкт-ітератор, можна надати кілька об’єктів, але необов’язково.
# Функція map() застосовує <function> до кожного елемента в iterable, щоб перетворити його на інше значення з додатковими функціями. map() генерує кожен перетворений елемент на вимогу. 
# Синтаксис виклику map() для одного ітератора виглядає так: map(<f>, <iterable>)
# map(<f>, <iterable>) повертає ітератор, який є результатом застосування функції <f> до кожного елемента <iterable>.


print(list(map(lambda x: x.upper(), animals)))

txns = [1.09, 23.56, 57.66, 4.66, 6.78]

TAX_RATE = .08

def price_with_tax(tx):
    return tx * (1 + TAX_RATE)

final_prices = map(price_with_tax, txns)

print(list(final_prices))

# Функція reverse() приймає рядковий аргумент і повертає його реверс, використовуючи механізм нарізки рядків [::-1]:
def reverse(s):
  return s[::-1]
reverse("I am a string") # 'gnirts a ma I'

# Якщо є список рядків, можна використовувати map() для застосування reverse() до кожного елемента списку:

animals = ["cat", "dog", "hedgehog", "gecko"]
iterator = map(reverse, animals)
# Iterator # <map object at 0x7fd3558cbef0>


# Функція map() повертає не список. а ітератор, який називається об’єктом-map. Щоб отримати значення з ітератора, потрібно або перебрати його, або використати list():
iterator = map(reverse, animals)
for i in iterator:
  print(i)
iterator = map(reverse, animals)
list(iterator) # ['tac', 'god', 'gohegdeh', 'okceg']

# можете використати анонімну лямбда-функцію:
animals = ["cat", "dog", "hedgehog", "gecko"]
iterator = map(lambda s: s[::-1], animals)
list(iterator) # ['tac', 'god', 'gohegdeh', 'okceg']
list(map(lambda s: s[::-1], ["cat", "dog", "hedgehog", "gecko"])) # ['tac', 'god', 'gohegdeh', 'okceg']
# Якщо iterable містить елементи, які не підходять для вказаної функції, тоді Python викликає виняток: list(map(lambda s: s[::-1], ["cat", "dog", 3.14159, "gecko"]))
# Traceback (most recent call last):
#   File "<stdin>", line 1, in <module>
#   File "<stdin>", line 1, in <lambda>
# TypeError: 'float' object is not subscriptable
# У цьому випадку лямбда-функція очікує рядкового аргументу, який вона намагається розділити. Другий елемент у списку, 3.14159, є об’єктом float, який не можна розділити. Тому виникає TypeError.

# str.join() об’єднує рядки з ітерованого елемента, розділених вказаним рядком:
"+".join(["cat", "dog", "hedgehog", "gecko"]) # 'cat+dog+hedgehog+gecko'

# Це добре працює, якщо об’єкти в списку є рядками.Якщо ні, то str.join() викликає виняток TypeError:  "+".join([1, 2, 3, 4, 5])
# Можна створити новий список, який містить рядкові представлення чисел у вихідному списку за допомогою циклу for. Потім ви можете передати новий список у .join():
strings = []
for i in [1, 2, 3, 4, 5]:
  strings.append(str(i))

# Strings # ['1', '2', '3', '4', '5']
"+".join(strings) # '1+2+3+4+5'

# Однак, оскільки map() застосовує функцію до кожного об’єкта списку по черзі, це часто може усунути потребу в явному циклі. У цьому випадку ви можете використовувати map(), щоб застосувати str() до об’єктів списку перед їх приєднанням:
"+".join(map(str, [1, 2, 3, 4, 5])) # '1+2+3+4+5'
# Функція map() використовується для перетворення списку. Передана функція викликається для кожного елемента в оригінальному списку та створюється новий список.  В цьому випадку для кожного елемента вираховується 2 * x + 10.

print(list(map(lambda x: x * 2 + 10, foo))) # [14, 46, 28, 54, 44, 58, 26, 34, 64]
print(list(map(lambda x: x.upper(), ['cat', 'dog', 'cow']))) # ['CAT', 'DOG', 'COW']

sentence = 'It is raining cats and dogs'
words = sentence.split()
print(words) # ['It', 'is', 'raining', 'cats', 'and', 'dogs']
lengths = map(lambda word: len(word), words)
print(list(lengths)) # [2, 2, 7, 4, 3, 4]
# розрахувати ціну після оподаткування:

txns = [1.09, 23.56, 57.84, 4.56, 6.78]
TAX_RATE = .08
def get_price_with_tax(txn):
  return txn * (1 + TAX_RATE)
final_prices = map(get_price_with_tax, txns)
list(final_prices)
# [1.1772000000000002, 25.4448, 62.467200000000005, 4.9248, 7.322400000000001]
# Потрібно обчислити квадратне значення всіх парних чисел у заданому списку. У цьому випадку ви можете використати filter() для вилучення парних чисел, а потім map() для обчислення квадратичних значень:
numbers = [1, 3, 10, 45, 6, 50]

def is_even(number):
  return number % 2 == 0

even_numbers = list(filter(is_even, numbers))
even_numbers # [10, 6, 50]

list(map(lambda n: n ** 2, even_numbers)) # [100, 36, 2500]
list(map(lambda n: n ** 2, filter(is_even, numbers))) # [100, 36, 2500]
# Є ще одна форма map(), яка приймає більше одного ітерованого аргументу:
# map(<f>, <iterablei> , <iterable₂>, ..., <iterableₙ>) - map застосовує <f> до елементів  у кожному <iterablei> паралельно та повертає ітератор, який дає результати. Кількість аргументів <iterablei>, указаних у map(), має збігатися  з кількістю аргументів, які очікує <f>. <f> діє на перший елемент кожного <iterablei>,  і цей результат стає першим елементом, який повертає ітератор. Потім <f> діє на другий елемент у кожному <iterablei>,  і він стає другим отриманим елементом і так далі.
def f(a, b, c):
  return a + b + c
list(map(f, [1, 2, 3], [10, 20, 30], [100, 200, 300])) # [111, 222, 333]
# Відповідно, для map() є три ісписки [1, 2, 3], [10, 20, 30] і [100, 200, 300].
# Перший повернутий елемент є результатом застосування f() до першого елемента  в кожному списку: f(1, 10, 100). Другим поверненим елементом є f(2, 20, 200), а третім – f(3, 30, 300)
# Значення, яке повертає map(), є ітератором, який дає список [111, 222, 333].
# ви можете замінити f() на лямбда-функцію:
list( map( (lambda a, b, c: a + b + c),  [1, 2, 3],  [10, 20, 30], [100, 200, 300]))


